# ------------------------Задания из Презентации------------------------------------------------------
# ---------------------------------1------------------------------------------------------------------
print("Задание 1")
a = int(input("Enter a: "))
b = int(input("Enter b: "))

# Sum a and b
sum_ab = a + b
print("Sum a and b", sum_ab)

# Difference a and b
dif_ab = a - b
print("Dif a and b", dif_ab)

# Product a and b
pro_ab = a * b
print("Pro a and b", pro_ab)

# Exponent a and b
exp_ab = a ** b
print("Exponent a and b", exp_ab)

# Modul a and b
mod_ab = a % b
print("Module a and b", mod_ab)

# Integer a and b
Int_ab = a // b
print("Integer a and b", Int_ab)
# ----------------------------------------------------------------------------------
# ------------------------------------2---------------------------------------------
print("Задание 2")
x1 = (17 / 2) * 3 + 2
print("X1 =", x1)

x2 = 2 + (17 / 2) * 3
print("x2 =", x2)

x3 = (19 % 4) + (15 / 2) * 3
print("x3 =", x3)

x4 = (15 + 6) - (10 * 4)
print("x4 =", x4)

x5 = (17 / 2) % 2 * (3 ** 3)
print("x5 =", x5)

# -------------------------------------------------------------------------------
# ----------------------------3--------------------------------------------------
print("Задание 3")
x = int(input("Enter x: "))
y = int(input("Enter y: "))

result = (abs(x) - abs(y)) / (1 + abs(x * y))
print("Result", result)
# --------------------------------------------------------------------------------
# -------------------------Задания из Телеграмма----------------------------------
# ---------------------------------1-----------------------------------------------
# ------------------------Порядок операций-----------------------------------------
# --------1. Parentheses - Скобки
# --------2. Exponentiation - Возведение в степень
# --------3. Multiplication - Умножение
# --------4. Division - деление
# --------5. Addition - сложение
# --------6. Subtraction - вычитание
print("Задание из Телеграмм 1")
z = 11 * (2 ** 2) - (13 / 4) + 7
print("Z =", z)
# ---------------------------------------------------------------------------------
# ---------------------------------2-----------------------------------------------
print("Задание из Телеграмм 2")
big_data = (4 * 4 * 4) + 4
print("Самое большое целое число из цифр 4:", big_data)
# ----------------------------------------------------------------------------------
# ---------------------------------3-------------------------------------------------
print("Задание из Телеграмм 3")
side1 = int(input("Enter side1: "))
side2 = int(input("Enter side2: "))

# -----Находим Гипотенузу-------
gipo = int((side1 ** 2 + side2 ** 2) ** 0.5)
print("Гипотенуза =", gipo)

# -----Находим площадь-------
S = 0.5 * (side1 * side2)

# ------ Находим Периметр ------
perim = side1 + side2 + gipo

# --------Результат------------

print("Площадь прямоугольного треугольника:", S)
print("Периметр =", perim)
# --------------------------------------------------------------------------
# ---------------------------------4-------------------------------------------------
print("Задание из Телеграмм 4")
number = int(input("Введите трехзначное число: "))
# Извлекаем цифры с помощью деления и остатка от деления
num1 = number // 100
num2 = (number // 10) % 10
num3 = number % 10
print("выводим числа на экран", num1, num2, num3)
# Сумма
summa = num1 + num2 + num3
print("Сумма", summa)
# ------------------------------------------done-------------------------------------------------
# -------------------------- давайте пожалуйста без школьной математики, хочется плакать---------
